# Built In Failures Rebar Shape Failures Crank With Hook Or End Treatment At The Same End Property

Source: https://www.revitapidocs.com/2026/2c5a8661-4a23-7f9d-0573-1ed7f95641e2.htm

---

| Built In Failures Rebar Shape Failures Crank With Hook Or End Treatment At The Same End Property |
| --- |

Cannot add crank, hooks and end treatments at the same end.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId CrankWithHookOrEndTreatmentAtTheSameEnd { get; }
```

```
Public Shared ReadOnly Property CrankWithHookOrEndTreatmentAtTheSameEnd As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ CrankWithHookOrEndTreatmentAtTheSameEnd {
	FailureDefinitionId^ get ();
}
```

```
static member CrankWithHookOrEndTreatmentAtTheSameEnd : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures RebarShapeFailures Class Autodesk.Revit.DB Namespace